Repository: phase1geo/Annotator
Catalog: po/extra/*.po
Languages: de, it, nl, pt_br, ru

source: Communicate with images better
de: Besser mit Bildern kommunizieren
it: Comunica meglio con le immagini
nl: Communiceer met betere afbeeldingen
pt_br: Comunique-se melhor com imagens
ru: Общайтесь с изображениями лучше

source: Edit Clipboard Image
de: Bild in der Zwischenablage bearbeiten
it: Modifica Immagine negli Appunti
nl: Klembordafbeelding bewerken
pt_br: Edite imagens da área de transferência
ru: Открыть файл из буфера обмена

source: Take Screenshot
de: Bildschirmfoto aufnehmen
ru: Сделать снимок экран

source: Communicate with images. Better.
de: Mit Bildern kommunizieren. Besser.
it: Comunica con le immagini. Meglio.
nl: Communiceer met afbeeldingen. Bétere afbeeldingen.
pt_br: Comunique-se com imagens. Melhor.
ru: Общайтесь с изображениями. Лучше.

source: Load image from the file system, clipboard or a screenshot.
de: Bild aus dem Dateisystem, der Zwischenablage oder einem Bildschirmfoto laden.
ru: Загружайте изображения из файловой системы, буфера обмена или снимка экрана.

source: Save custom shapes for easy reuse.
de: Benutzerdefinierte Formen zur einfachen Wiederverwendung speichern.
ru: Сохраняйте пользовательские фигуры для повторного использования.

source: Add magnifiers to enhance image details.
de: Lupen hinzufügen, um Bilddetails zu verbessern.
it: Aggiungi lenti di ingrandimento per migliorare i dettagli dell'immagine.
nl: Voeg vergrotingen toe om details te verduidelijken.
pt_br: Adicione uma lupa para melhorar os detalhes da imagem.
ru: Добавляйте лупы, чтобы улучшить детали изображения.

source: Blur out portions of the image to obfuscate data.
de: Teile des Bildes weichzeichnen, um Daten unkenntlich zu machen.
it: Sfoca porzioni dell'immagine per offuscare i dati.
nl: Vervaag privédelen van afbeeldingen.
pt_br: Desfoque partes da imagem para ofuscar os dados.
ru: Размывайте части изображения, чтобы скрыть данные.

source: Crop, resize and add image borders.
de: Zuschneiden, Größe ändern und Bildränder hinzufügen.
it: Ritaglia, ridimensiona e aggiungi bordi dell'immagine.
nl: Snijd afbeeldingen bij, verklein ze of voeg kaders toe.
pt_br: Corte, redimensione e adicione bordas de imagem.
ru: Обрезайте, меняйте размер и добавляйте границы изображения.

source: Control colors, line thickness and font details.
de: Farben, Linienstärke und Schriftdetails einstellen.
it: Controlla i colori, lo spessore della linea e i dettagli dei caratteri.
nl: Bepaal kleuren, lijndikten en lettertypen.
pt_br: Controle as cores, a espessura da linha e os detalhes da fonte.
ru: Управляйте цветами, толщиной линий и шрифтами.

source: Built-in color picker to copy image pixel color to clipboard.
de: Eingebauter Farbwähler zum Kopieren von Bildpixelfarben in die Zwischenablage.

source: Zoom support.
de: Zoom-Unterstützung.
it: Supporto per lo zoom.
nl: Zoomondersteuning.
pt_br: Suporte para zoom.
ru: Поддержка приближения.

source: Unlimited undo/redo of any change.
de: Unbegrenztes Rückgängigmachen/Wiederherstellen jeder Änderung.
it: Annulla/ripeti illimitati di qualsiasi modifica.
nl: Ongelimiteerd ongedaan maken/opnieuw uitvoeren van aanpassingen.
pt_br: Desfazer/refazer ilimitado de qualquer alteração.
ru: Неограниченное количество отмен/повторов любых изменений.

source: Export to JPEG, PNG, TIFF, BMP, PDF and SVG image formats.
de: Export in die Bildformate JPEG, PNG, TIFF, BMP, PDF und SVG.
it: Esporta in formati immagine JPEG, PNG, TIFF, BMP, PDF e SVG.
nl: Exporteer naar jpeg-, png-, tiff-, bmp-, pdf- en svg-formaat.
pt_br: Exporte para os formatos de imagem JPEG, PNG, TIFF, BMP, PDF e SVG.
ru: Экспорт в JPEG, PNG, TIFF, BMP, PDF и SVG.

source: Support for copying annotated image to clipboard.
de: Unterstützung für das Kopieren von annotierten Bildern in die Zwischenablage.
it: Supporto per la copia di immagini annotate negli appunti.
nl: Ondersteuning voor het kopiëren van afbeeldingen naar het klembord.
pt_br: Suporte para copiar imagens anotadas para a área de transferência.
ru: Поддержка копирования отредактированного изображения в буфер обмена.

source: Printer support.
de: Drucker-Unterstützung.
it: Supporto stampante.
nl: Afdrukondersteuning.
pt_br: Suporte a impressoras.
ru: Поддержка принтеров.

source: New
de: Neu
ru: Новое

source: Added support for inserting images.
de: Unterstützung für das Einfügen von Bildern hinzugefügt.

source: Added support for inserting speech and thought bubble shapes.
de: Unterstützung für das Einfügen von Sprach- und Gedankenblasenformen hinzugefügt.

source: Changes
de: Änderungen
ru: Изменения

source: Bug Fixes
de: Fehlerkorrekturen
ru: Исправления ошибок

source: Fixed issue with duplicating canvas items by holding Control while dragging an item.
de: Problem bei der Duplizierung von Leinwandelementen durch Festhalten der Steuerungstaste beim Ziehen eines Elements behoben.

source: Fixed issue with certain icons not displaying properly in dark mode.
de: Problem bei der Anzeige bestimmter Symbole im dunklen Modus behoben.

source: Added Russian translation (thanks to @lenemter).
de: Russische Übersetzung hinzugefügt (Dank an @lenemter).

source: Updated Italian translations (thanks to @albanobattistella).
de: Italienische Übersetzungen aktualisiert (Dank an @albanobattistella).

source: Updated Dutch translation (thanks to Heimen Stoffels).
de: Niederländische Übersetzung aktualisiert (Dank an Heimen Stoffels).
ru: Обновлён голландский перевод (спасибо Heimen Stoffels).

source: Fixed translation string issues related to Zoom and Screenshot (thanks to @lenemter).
de: Probleme mit den Übersetzungszeichenketten im Zusammenhang mit Zoom und Bildschirmfoto behoben (Dank an @lenemter).

source: Adding support for taking screenshots from within the application (screen, window and area).
de: Unterstützung für die Aufnahme von Bildschirmfotos aus der Anwendung (Bildschirm, Fenster und Bereich) heraus hinzugefügt.

source: Adding command-line options for taking screenshots.
de: Befehlszeilenoptionen für die Erstellung von Bildschirmfotos hinzugefügt.
ru: Добавлен параметр командной строки для создания скриншотов.

source: Adding support for creating and saving custom arrows and shapes.
de: Unterstützung für das Erstellen und Speichern von benutzerdefinierten Pfeilen und Formen hinzugefügt.
ru: Добавлена поддержка создания и сохранения пользовательских стрелок и фигур.

source: Updated Italian translation (thanks to @albanobattistella).
de: Italienische Übersetzung aktualisiert (Dank an @albanobattistella).
ru: Обновлён итальянский перевод (спасибо @albanobattistella).

source: Updated Flatpak SDK from version 6 to 6.1.
de: Flatpak SDK von Version 6 auf 6.1 aktualisiert.
ru: Обновлена версия Flatpak SDK с 6 до 6.1.

source: Modified .gitignore to ignore .swp files from anywhere in the codebase.
de: .gitignore wurde so geändert, dass .swp-Dateien in der gesamten Codebasis ignoriert werden.
ru: В .gitignore были добавлены файлы .swp для удаления их из кода.

source: Changed shape dropdown to display four shapes per row instead of two.
de: Das Dropdown-Menü für die Formen wurde so geändert, dass jetzt vier statt zwei Formen pro Zeile angezeigt werden.
ru: Изменено раскрывающееся меню фигур, чтобы отображать четыре фигуры в строке вместо двух.

source: Enhanced export UI and adding export options for PNG and JPEG types.
de: Export-UI verbessert und Exportoptionen für die Typen PNG und JPEG hinzugefügt.
ru: Улучшен пользовательский интерфейс экспорта и добавлены параметры экспорта в PNG и JPEG.

source: Changed JPEG export to use both .jpeg and .jpg file extensions (defaults to .jpg now).
de: Der JPEG-Export wurde so geändert, dass sowohl die Dateierweiterung .jpeg als auch .jpg verwendet wird (Standardeinstellung ist jetzt .jpg).
ru: Изменён экспорт JPEG для использования файлов с расширениями .jpeg и .jpg (теперь по умолчанию используется .jpg).

source: Improved arrow icon in toolbar.
de: Pfeilsymbol in der Symbolleiste verbessert.
ru: Улучшен значок стрелки на панели инструментов.

source: Improved ability to click on shapes that only have borders.
de: Möglichkeit, auf Formen zu klicken, die nur Ränder haben, verbessert.
ru: Улучшена возможность нажимать на фигуры, которые имеют только границы.

source: Fixed issues with copying the contents of one shape into another.
de: Probleme beim Kopieren des Inhalts einer Form in eine andere Form behoben.
ru: Исправлены проблемы с копированием содержимого одной фигуры в другую.

source: Fixed issue with displaying star and line icons in shapes toolbar for dark mode.
de: Problem mit der Anzeige von Stern- und Liniensymbolen in der Symbolleiste für Formen im dunklen Modus behoben.
ru: Исправлена проблема с отображением значков звёздочек и линий на панели инструментов фигур в тёмном режиме.

source: Added keyboard shortcuts for creating annotation items, printing and displaying contextual menus.
de: Tastaturkürzel zum Erstellen von Annotationselementen, Drucken und Anzeigen von Kontextmenüs hinzugefügt.
ru: Добавлены сочетания клавиш для создания элементов аннотаций, печати и отображения контекстных меню.

source: Added keyboard shortcut support for non-English keyboards.
de: Unterstützung von Tastaturkürzeln für nicht-englische Tastaturen hinzugefügt.
ru: Добавлена поддержка сочетаний клавиш для неанглийских клавиатур.

source: Added Brazilian Portuguese translation (thanks to Fúlvio Alves).
de: Übersetzung ins brasilianische Portugiesisch hinzugefügt (Dank an Fúlvio Alves).
ru: Добавлен бразильский португальский перевод (спасибо Fúlvio Alves).

source: Added Slovak translation (thanks to @MartinIIOT)
de: Slowakische Übersetzung hinzugefügt (Dank an @MartinIIOT)
ru: Добавлен словацкий перевод (спасибо @MartinIIOT)

source: Added support for hitting the escape key to deselect all items on the canvas.
de: Unterstützung für das Drücken der Escape-Taste, um die Auswahl aller Elemente auf der Leinwand aufzuheben.
ru: Добавлена поддержка нажатия клавиши выхода для отмены выбора всех элементов на холсте.

source: Updated German translation (thanks to Hannes Fritz).
de: Deutsche Übersetzung aktualisiert (Dank an Hannes Fritz).
ru: Обновлён немецкий перевод (спасибо Hannes Fritz).

source: Updated zoom UI to make it more consistent with other elementary apps.
de: Zoom-Benutzeroberfläche aktualisiert, um sie einheitlicher mit anderen Elementary-Apps zu machen.
ru: Обновлйн пользовательский интерфейс масштабирования, чтобы сделать его более совместимым с другими приложениями elementary.

source: Improved accuracy of the list of translatable files.
de: Genauigkeit der Liste der übersetzbaren Dateien verbessert.
ru: Улучшена точность списка переводимых файлов.

source: Moved arrow annotation to its own button in the toolbar.
de: Pfeilannotation wurde in eine eigene Schaltfläche in der Symbolleiste verschoben.
ru: Аннотация со стрелкой перемещена в собственную кнопку на панели инструментов.

source: Removed Accounts permissions from Flatpak manifest as it is no longer needed.
de: Berechtigungen für Konten wurden aus dem Flatpak-Manifest entfernt, da sie nicht mehr benötigt werden.
ru: Удалены разрешения учетных записей из манифеста Flatpak, так как они больше не нужны.

source: Removed text grab selector when editing text.
de: Selektor zum Greifen von Text beim Bearbeiten von Text entfernt.
ru: Удалён селектор захвата текста при редактировании текста.

source: Changed behavior of Return key when text is edited to keep the text item selected.
de: Verhalten der Return-Taste bei der Bearbeitung von Text geändert, damit das Textelement ausgewählt bleibt.
ru: Изменено поведение клавиши Enter при редактировании текста, чтобы текстовый элемент оставался выделенным.

source: Fixed icons8_cup sticker issue (thanks to Jan Tojnar).
de: Problem mit icons8_cup-Stickern behoben (Dank an Jan Tojnar).
ru: Исправлена ​​проблема со стикером icons8_cup (спасибо Jan Tojnar).

source: Fixed issue where the toolbar state did not update to match the currently selected item.
de: Problem, bei dem der Status der Symbolleiste nicht mit dem aktuell ausgewählten Element übereinstimmte, behoben.
ru: Исправлена проблема, из-за которой состояние панели инструментов не обновлялось в соответствии с текущим выбранным элементом.

source: Fixed issue where dragging a blur rectangle outside of the image caused application crash.
de: Problem, bei dem das Ziehen eines Weichzeichnungsrechtecks außerhalb des Bildes zum Absturz der Anwendung führte, behoben.
ru: Исправлена проблема, из-за которой перетаскивание прямоугольника размытия за пределы изображения приводило к вылету приложения.

source: Fixed issue where a text widget could be deleted but remain on the canvas.
de: Problem behoben, bei dem ein Textwidget gelöscht werden konnte, aber auf der Leinwand verblieb.
ru: Исправлена ошибка, из-за которой текстовый виджет мог быть удалён, но он оставался на холсте.

source: Initial release.
de: Erste Veröffentlichung.
it: Versione iniziale.
nl: Eerste uitgave.
pt_br: Lançamento inicial.
ru: Начальный выпуск.

source: annotator;image;annotate;
it: annotatore; immagine; annotazione;
nl: aantekeningen;afbeelding;aantekening;
pt_br: imagem;anotador;annotator;image;annotate;
ru: annotator;image;annotate;аннотатор;комментатор;изображение;картинка;аннотировать;комментировать;

source: Added keyboard shortcut cheatsheet.
ru: Добавлена шпаргалка по сочетаниям клавиш.

source: Load image from the file system or clipboard.
it: Carica l'immagine dal file system o dagli appunti.
pt_br: Carregue a imagem do sistema de arquivos ou da área de transferência.

source: Add shapes, stickers, text, drawings, and other callouts to highlight image details.
it: Aggiungi forme, adesivi, testo, disegni e altri richiami per evidenziare i particolari dell'immagine.
nl: Voeg vormen, stickers, tekst, tekeningen en andere items toe om afbeeldingen te verduidelijken.
pt_br: Adicione formas, adesivos, texto, desenhos ou outros textos explicativos para destacar os detalhes da imagem.

source: Annotator
nl: Aantekeningen
